tap "felixkratz/formulae"
tap "joshmedeski/sesh"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "neilberkman/clippy"
tap "nikitabobko/tap"
brew "bash"
brew "openssl@3"
brew "bat"
brew "btop"
brew "chafa"
brew "clipboard"
brew "cloc"
brew "cowsay"
brew "displayplacer"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fortune"
brew "fzf"
brew "gdu"
brew "ghcup"
brew "git"
brew "git-delta"
brew "gnu-tar"
brew "go"
brew "htop"
brew "imagemagick"
brew "jack"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "python@3.13"
brew "lua"
brew "luarocks"
brew "mpc"
brew "mpd", restart_service: :changed
brew "mpv"
brew "ncmpcpp"
brew "neovim"
brew "nowplaying-cli"
brew "pipenv"
brew "pipx"
brew "pkgconf"
brew "poetry"
brew "poppler"
brew "procs"
brew "protobuf"
brew "ranger"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "rustup"
brew "sevenzip"
brew "stow"
brew "switchaudio-osx"
brew "tectonic"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "yazi"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "joshmedeski/sesh/sesh"
brew "koekeishiya/formulae/skhd"
brew "neilberkman/clippy/clippy"
cask "aerospace"
cask "dotnet-sdk"
cask "draggy"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "kitty"
cask "sf-symbols"
cask "wezterm"
