tap "chojs23/tap"
tap "felixkratz/formulae"
tap "joshmedeski/sesh"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "neilberkman/clippy"
tap "nikitabobko/tap"
tap "redis/redis"
brew "bash"
brew "openssl@3"
brew "bat"
brew "btop"
brew "chafa"
brew "clipboard"
brew "cloc"
brew "cowsay"
brew "displayplacer"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fortune"
brew "fzf"
brew "gdu"
brew "gh"
brew "ghcup"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "haskell-stack"
brew "htop"
brew "imagemagick"
brew "jack"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "markdownlint-cli2"
brew "mpc"
brew "mpd", restart_service: :changed
brew "mpv"
brew "ncmpcpp"
brew "neovim"
brew "nowplaying-cli"
brew "pipenv"
brew "python@3.13"
brew "pipx"
brew "pkgconf"
brew "poetry"
brew "poppler"
brew "procs"
brew "protobuf"
brew "ranger"
brew "ripgrep"
brew "sevenzip"
brew "sqlfluff"
brew "stow"
brew "switchaudio-osx"
brew "tectonic"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tree"
brew "tree-sitter-cli"
brew "wget"
brew "xcodegen"
brew "zoxide"
brew "chojs23/tap/ec"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "joshmedeski/sesh/sesh"
brew "koekeishiya/formulae/skhd"
brew "neilberkman/clippy/clippy"
cask "nikitabobko/tap/aerospace"
cask "claude-code"
cask "neilberkman/clippy/draggy"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "kitty"
cask "sf-symbols"
vscode "redhat.java"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
cargo "alacritty"
cargo "kanata"
cargo "rmpc"
cargo "ronfmt"
cargo "yazi-build"
cargo "yazi-cli"
cargo "yazi-fm"
