appimagelauncher
awesome-git
brave-bin
clipboard
dracula-gtk-theme
dracula-icons-theme
easy-conflict-bin
ghcup-hs-bin
gtk2
haskell-data-array-byte
haskell-fsnotify0.3
http-parser
i3-back-bin
i3lock-color
js115
libgrss
libjpeg6-turbo-bin
networkmanager-dmenu-git
openssl-1.1
python-imageio-ffmpeg
python-screeninfo
qtile-extras
sesh-bin
snapd
sublime-text-4
swaylock-effects
trayer
ttf-joypixels
ttf-ms-fonts
ttf-vista-fonts
turbo-base64
viber
waypaper
wlprop
xautolock
xidlehook
yay
