7zip
acpi
adobe-source-han-sans-otc-fonts
alacritty
alsa-utils
appimagelauncher
autotiling
awesome
baobab
base
base-devel
bashtop
bat
bc
bluetui
bluez-utils
brightnessctl
bspwm
btop
btrfs-progs
busted
clipboard
cliphist
cmatrix
cmus
conky
cronie
ddcutil
ddgr
delve
deno
dkms
dmenu
docker
docker-compose
dotnet-sdk
dracula-gtk-theme
dracula-icons-theme
dunst
efibootmgr
entr
eog
epiphany
ethtool
evince
eza
fastfetch
fd
feh
ffmpegthumbnailer
flameshot
foot
fuse2
fzf
gammastep
gdm
gdu
ghostty
git
git-delta
glow
gnome-backgrounds
gnome-calculator
gnome-calendar
gnome-characters
gnome-clocks
gnome-color-manager
gnome-connections
gnome-console
gnome-contacts
gnome-control-center
gnome-disk-utility
gnome-font-viewer
gnome-keyring
gnome-logs
gnome-maps
gnome-menus
gnome-music
gnome-remote-desktop
gnome-session
gnome-settings-daemon
gnome-shell
gnome-shell-extension-appindicator
gnome-shell-extensions
gnome-software
gnome-system-monitor
gnome-text-editor
gnome-tour
gnome-tweaks
gnome-user-docs
gnome-user-share
gnome-weather
gnu-free-fonts
gpick
grilo-plugins
grim
gst-plugin-pipewire
gum
gvfs
gvfs-afc
gvfs-dnssd
gvfs-goa
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-onedrive
gvfs-smb
gvfs-wsdd
htop
hypridle
hyprland
hyprlock
hyprpaper
hyprpicker
hyprpolkitagent
hyprsunset
i3-wm
i3blocks
i3lock-color
i3status
impala
intel-ucode
iwd
jq
k9s
kitty
kolourpaint
lazydocker
lazygit
libpulse
linux
linux-firmware
linux-headers
localsearch
loupe
luarocks
lxqt-config
malcontent
man-db
mermaid-cli
meson
mpc
mpd
mpd-mpris
mpv
mpv-mpris
nano
nautilus
ncmpcpp
neovim
network-manager-applet
networkmanager
nfs-utils
noto-fonts
noto-fonts-cjk
ntfs-3g
nvidia-open-dkms
nwg-look
pamixer
pavucontrol
picom
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
playerctl
pngquant
polkit-gnome
polybar
procs
pulseaudio-alsa
python-dbus
python-dbus-fast
python-dbus-next
python-pip
python-setuptools
qbittorrent
qtile
qtile-extras
ranger
redshift
ripgrep
rofi
rust
rust-analyzer
rygel
simple-scan
slock
smartmontools
snapshot
socat
sof-firmware
stow
sublime-text-4
sushi
swappy
sway
swaybg
swayidle
swaylock-effects
swaync
sxhkd
tecla
telegram-desktop
television
terminus-font
texlive-binextra
thunar
tldr
tllist
tlp
tmux
totem
trayer
tree
tree-sitter-cli
ttf-joypixels
ttf-liberation
ttf-ms-fonts
ttf-vista-fonts
unarchiver
usbutils
viber
vim
vlc
volumeicon
waybar
wev
wezterm
wget
wireless_tools
wiremix
wireplumber
wl-clipboard
wlprop
wlr-randr
wlrctl
wmctrl
wqy-zenhei
xautolock
xclip
xdg-desktop-portal-gnome
xdg-desktop-portal-hyprland
xdg-desktop-portal-wlr
xdg-user-dirs-gtk
xdg-utils
xdo
xdotool
xfce4-settings
xidlehook
xorg-server
xorg-server-xephyr
xorg-xev
xorg-xinit
xorg-xrandr
xorg-xsetroot
xsel
xsettings-client
xsettingsd
xss-lock
xterm
yay
yelp
zellij
zig
zip
zoxide
zram-generator
zsh
