appimagelauncher
awesome-git
bashdb
brave-bin
clipboard
dracula-gtk-theme
dracula-icons-theme
ghcup-hs-bin
haskell-data-array-byte
i3-back-bin
i3lock-color
insomnia
networkmanager-dmenu-git
pinta
qtile-extras
sesh-bin
snapd
sublime-text-4
swaylock-effects
ttf-joypixels
turbo-base64
wlprop
xautolock
yay
